validationCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "280000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
38500
(
(3.98949e-19 -1.51319e-18 -0.0159652)
(5.14002e-19 -1.35143e-18 -0.0159757)
(4.9571e-19 -1.2234e-18 -0.0159856)
(5.28651e-19 -1.0458e-18 -0.0159949)
(5.58307e-19 -1.23089e-18 -0.0160036)
(2.33783e-19 -1.40929e-18 -0.0160119)
(-1.6566e-19 -1.59749e-18 -0.0160196)
(-1.34847e-19 -1.46948e-18 -0.0160268)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
