validationCase/0/strainRate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "280000";
    object      strainRate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
38500
(
0.00332989
0.00319981
0.00315757
0.00309714
0.00302946
0.00295938
0.00288889
0.00281898
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.528039
0.527965
0.527862
0.527751
0.527633
0.527516
0.527402
0.527294
...
)
;
    }
}


// ************************************************************************* //
