validationCase/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "280000";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
38500
(
(0.00303119 0.00137843 4.02903e-17)
(0.00192815 0.00255363 6.35173e-18)
(0.00204078 0.00240946 -1.02242e-17)
(0.00210743 0.00226958 -1.23718e-17)
(0.00215154 0.00213272 2.35645e-18)
(0.0021811 0.00200019 7.90211e-18)
(0.00220063 0.00187162 7.27082e-18)
(0.00221269 0.00174661 6.54759e-18)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-0.367445 0.379222 -1.85463e-16)
(-0.355327 0.390499 2.86998e-17)
(-0.34282 0.401389 -2.05244e-16)
(-0.329974 0.411872 2.80808e-16)
(-0.316803 0.421939 -1.55243e-16)
(-0.303327 0.431585 6.76232e-17)
(-0.289559 0.440805 8.932e-17)
(-0.275514 0.44959 -6.15441e-17)
...
)
;
    }
}


// ************************************************************************* //
