validationCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}


divSchemes
{
    default         none;
    div(phi,U) Gauss limitedLinearV 1;
    div(phi,k)      bounded Gauss limitedLinear 1;
    div(phi,epsilon) bounded Gauss limitedLinear 1;
    div(phi,omega) Gauss limitedLinear 0.5; // for a balance of stability and accuracy
    div(phi,v2)     bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear corrected;
    div(nonlinearStress) Gauss linear;
    div(*grad(k))   Gauss linear;
    div(symm(grad(U))) Gauss linear corrected;
    div((((2*C_tau)*((((-tau0|(sqrt(((2*magSqr(symm(grad(U))))+((((C_beta*betaStar_)*omega)*k)|nu)))*sqrt(((2*magSqr(symm(grad(U))))+((((C_beta*betaStar_)*omega)*k)|nu)))))+((K*(n-1))*pow(sqrt(((2*magSqr(symm(grad(U))))+((((C_beta*betaStar_)*omega)*k)|nu))),(n-2))))*(((C_beta*betaStar_)*omega)*k))|(nu*sqrt(((2*magSqr(symm(grad(U))))+((((C_beta*betaStar_)*omega)*k)|nu))))))*symm(grad(U))))  	Gauss linear corrected;

    div((((2*C_tau)*((((((-tau0|(sqrt((2*magSqr(symm(grad(U)))))*sqrt((2*magSqr(symm(grad(U)))))))+((K*(n-1))*pow(sqrt((2*magSqr(symm(grad(U))))),(n-2))))*(((C_beta*betaStar_)*omega)*k))|(nu_modified*sqrt((2*magSqr(symm(grad(U)))))))+nu_modified)-nu))*symm(grad(U))))	Gauss linear corrected;

}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(zetaCoeff,k) Gauss linear corrected;
    laplacian(muEffCustom,U) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
